In [1]:
import numpy as np
import pandas as pd
import warnings

In [2]:
warnings.filterwarnings('ignore')

# GET DATA

In [19]:
columns_name = ["user_id", "item_id", "rating", "timestamp"] 
df = pd.read_csv("ml-100k/u.data", sep = "\t", names = columns_name)

In [20]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [21]:
df.shape

(100000, 4)

In [60]:
movies_title = pd.read_csv("ml-100k/u.item", sep = '|', header = None, encoding='us-ascii')

In [61]:
movies_title.shape

(1682, 24)

In [62]:
movies_title.head()

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [64]:
movies_title = movies_title[[0, 1]]

In [59]:
movies_title.head()

   1                                   Toy Story (1995)
0  2                                   GoldenEye (1995)
1  3                                  Four Rooms (1995)
2  4                                  Get Shorty (1995)
3  5                                     Copycat (1995)
4  6  Shanghai Triad (Yao a yao yao dao waipo qiao) ...